hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_sdm_regs.h
/*
 * FFSYNCCLREN (RW)
 *
 * Auto clear FIFO when a new SDSYNC event is found. Only valid when WTSYNCEN=1
 */
#define SDM_CH_SDCTRLP_FFSYNCCLREN_MASK (0x40U)
#define SDM_CH_SDCTRLP_FFSYNCCLREN_SHIFT (6U)
#define SDM_CH_SDCTRLP_FFSYNCCLREN_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_FFSYNCCLREN_SHIFT) & SDM_CH_SDCTRLP_FFSYNCCLREN_MASK)
#define SDM_CH_SDCTRLP_FFSYNCCLREN_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_FFSYNCCLREN_MASK) >> SDM_CH_SDCTRLP_FFSYNCCLREN_SHIFT)

/*
 * WTSYNACLR (RW)
 *
 * 1: Asserted to Auto clear WTSYNFLG when the SDFFINT is gen
 * 0: WTSYNFLG should be cleared manually by WTSYNMCLR
 */
#define SDM_CH_SDCTRLP_WTSYNACLR_MASK (0x20U)
#define SDM_CH_SDCTRLP_WTSYNACLR_SHIFT (5U)
#define SDM_CH_SDCTRLP_WTSYNACLR_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_WTSYNACLR_SHIFT) & SDM_CH_SDCTRLP_WTSYNACLR_MASK)
#define SDM_CH_SDCTRLP_WTSYNACLR_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_WTSYNACLR_MASK) >> SDM_CH_SDCTRLP_WTSYNACLR_SHIFT)

/*
 * WTSYNMCLR (RW)
 *
 * 1: Manually clear WTSYNFLG. Auto-clear.
 */
#define SDM_CH_SDCTRLP_WTSYNMCLR_MASK (0x10U)
#define SDM_CH_SDCTRLP_WTSYNMCLR_SHIFT (4U)
#define SDM_CH_SDCTRLP_WTSYNMCLR_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_WTSYNMCLR_SHIFT) & SDM_CH_SDCTRLP_WTSYNMCLR_MASK)
#define SDM_CH_SDCTRLP_WTSYNMCLR_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_WTSYNMCLR_MASK) >> SDM_CH_SDCTRLP_WTSYNMCLR_SHIFT)

/*
 * WTSYNCEN (RW)
 *
 * 1: Start to store data only after PWM SYNC event
 * 0: Start to store data whenever enabled
 */
#define SDM_CH_SDCTRLP_WTSYNCEN_MASK (0x8U)
#define SDM_CH_SDCTRLP_WTSYNCEN_SHIFT (3U)
#define SDM_CH_SDCTRLP_WTSYNCEN_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_WTSYNCEN_SHIFT) & SDM_CH_SDCTRLP_WTSYNCEN_MASK)
#define SDM_CH_SDCTRLP_WTSYNCEN_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_WTSYNCEN_MASK) >> SDM_CH_SDCTRLP_WTSYNCEN_SHIFT)

/*
 * D32 (RW)
 *
 * 1:32 bit data
 * 0:16 bit data
 */
#define SDM_CH_SDCTRLP_D32_MASK (0x4U)
#define SDM_CH_SDCTRLP_D32_SHIFT (2U)
#define SDM_CH_SDCTRLP_D32_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_D32_SHIFT) & SDM_CH_SDCTRLP_D32_MASK)
#define SDM_CH_SDCTRLP_D32_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_D32_MASK) >> SDM_CH_SDCTRLP_D32_SHIFT)

/*
 * DR_OPT (RW)
 *
 * 1: Use Data FIFO Ready as data ready when fifo fillings are greater than the threshold
 * 0: Use Data Reg Ready as data ready
 */
#define SDM_CH_SDCTRLP_DR_OPT_MASK (0x2U)
#define SDM_CH_SDCTRLP_DR_OPT_SHIFT (1U)
#define SDM_CH_SDCTRLP_DR_OPT_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_DR_OPT_SHIFT) & SDM_CH_SDCTRLP_DR_OPT_MASK)
#define SDM_CH_SDCTRLP_DR_OPT_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_DR_OPT_MASK) >> SDM_CH_SDCTRLP_DR_OPT_SHIFT)

/*
 * EN (RW)
 *
 * Data Path Enable
 */
#define SDM_CH_SDCTRLP_EN_MASK (0x1U)
#define SDM_CH_SDCTRLP_EN_SHIFT (0U)
#define SDM_CH_SDCTRLP_EN_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_EN_SHIFT) & SDM_CH_SDCTRLP_EN_MASK)
#define SDM_CH_SDCTRLP_EN_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_EN_MASK) >> SDM_CH_SDCTRLP_EN_SHIFT)

/* Bitfield definition for register of struct array CH: SDCTRLE */
/*
 * CIC_GATE_TYPE (RW)
 *
 * 1: the gate cycle is determined by SDFIFOCTRLn[GATE_SAMPLES].
 * 0: the gate cycle is determined by the CIC decimation counter, and the minimal gated off PDM bits are determined by SDFIFOCTRLn[GATE_SAMPLES], and at the same time, to keep alignment with normal PCM sampling time.
 */
#define SDM_CH_SDCTRLE_CIC_GATE_TYPE_MASK (0x80000000UL)
#define SDM_CH_SDCTRLE_CIC_GATE_TYPE_SHIFT (31U)
#define SDM_CH_SDCTRLE_CIC_GATE_TYPE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_GATE_TYPE_SHIFT) & SDM_CH_SDCTRLE_CIC_GATE_TYPE_MASK)
#define SDM_CH_SDCTRLE_CIC_GATE_TYPE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_GATE_TYPE_MASK) >> SDM_CH_SDCTRLE_CIC_GATE_TYPE_SHIFT)

/*
 * CIC_GATE_POL (RW)
 *
 * 1: When mask signal is 1, pause the CIC stage at he rising edge of mask signal.
 * 0: When mask signal is 0, pause the CIC stage at he falling edge of mask signal.
 */
#define SDM_CH_SDCTRLE_CIC_GATE_POL_MASK (0x40000000UL)
#define SDM_CH_SDCTRLE_CIC_GATE_POL_SHIFT (30U)
#define SDM_CH_SDCTRLE_CIC_GATE_POL_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_GATE_POL_SHIFT) & SDM_CH_SDCTRLE_CIC_GATE_POL_MASK)
#define SDM_CH_SDCTRLE_CIC_GATE_POL_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_GATE_POL_MASK) >> SDM_CH_SDCTRLE_CIC_GATE_POL_SHIFT)

/*
 * CIC_GATE_SEL (RW)
 *
 * Select the mask signal for CIC gate signal.
 */
#define SDM_CH_SDCTRLE_CIC_GATE_SEL_MASK (0x3C000000UL)
#define SDM_CH_SDCTRLE_CIC_GATE_SEL_SHIFT (26U)
#define SDM_CH_SDCTRLE_CIC_GATE_SEL_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_GATE_SEL_SHIFT) & SDM_CH_SDCTRLE_CIC_GATE_SEL_MASK)
#define SDM_CH_SDCTRLE_CIC_GATE_SEL_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_GATE_SEL_MASK) >> SDM_CH_SDCTRLE_CIC_GATE_SEL_SHIFT)

/*
 * CIC_GATE_EN (RW)
 *
 * 1: the CIC stage can be paused by the mask input.
 * 0: the CIC stage won't be paused by the mask input.
 */
#define SDM_CH_SDCTRLE_CIC_GATE_EN_MASK (0x2000000UL)
#define SDM_CH_SDCTRLE_CIC_GATE_EN_SHIFT (25U)
#define SDM_CH_SDCTRLE_CIC_GATE_EN_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_GATE_EN_SHIFT) & SDM_CH_SDCTRLE_CIC_GATE_EN_MASK)
#define SDM_CH_SDCTRLE_CIC_GATE_EN_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_GATE_EN_MASK) >> SDM_CH_SDCTRLE_CIC_GATE_EN_SHIFT)

/*
 * TIMESTAMP_TYPE (RW)
 *
 * 1. Use the time (when the data is calculated out) - delta_time_of_filter_span as the timestamp.
 * 0: Use the time when the data is calculated out.
 */
#define SDM_CH_SDCTRLE_TIMESTAMP_TYPE_MASK (0x400000UL)
#define SDM_CH_SDCTRLE_TIMESTAMP_TYPE_SHIFT (22U)
#define SDM_CH_SDCTRLE_TIMESTAMP_TYPE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_TIMESTAMP_TYPE_SHIFT) & SDM_CH_SDCTRLE_TIMESTAMP_TYPE_MASK)
#define SDM_CH_SDCTRLE_TIMESTAMP_TYPE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_TIMESTAMP_TYPE_MASK) >> SDM_CH_SDCTRLE_TIMESTAMP_TYPE_SHIFT)

/*
 * DFIFO_S_T (RW)
 *
 * 1: the output of SDFIFO is data and timestamp interleaved. First is data.
 * 0: the output of SDFIFO is data only
 */
#define SDM_CH_SDCTRLE_DFIFO_S_T_MASK (0x200000UL)
#define SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT (21U)
#define SDM_CH_SDCTRLE_DFIFO_S_T_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT) & SDM_CH_SDCTRLE_DFIFO_S_T_MASK)
#define SDM_CH_SDCTRLE_DFIFO_S_T_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_DFIFO_S_T_MASK) >> SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT)

