hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_sdm_regs.h
/* Bitfield definition for register of struct array CH: SCCTRL */
/*
 * HZ_EN (RW)
 *
 * Zero Crossing Enable
 */
#define SDM_CH_SCCTRL_HZ_EN_MASK (0x800000UL)
#define SDM_CH_SCCTRL_HZ_EN_SHIFT (23U)
#define SDM_CH_SCCTRL_HZ_EN_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_HZ_EN_SHIFT) & SDM_CH_SCCTRL_HZ_EN_MASK)
#define SDM_CH_SCCTRL_HZ_EN_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_HZ_EN_MASK) >> SDM_CH_SCCTRL_HZ_EN_SHIFT)

/*
 * MF_IE (RW)
 *
 * Module failure Interrupt enable
 */
#define SDM_CH_SCCTRL_MF_IE_MASK (0x400000UL)
#define SDM_CH_SCCTRL_MF_IE_SHIFT (22U)
#define SDM_CH_SCCTRL_MF_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_MF_IE_SHIFT) & SDM_CH_SCCTRL_MF_IE_MASK)
#define SDM_CH_SCCTRL_MF_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_MF_IE_MASK) >> SDM_CH_SCCTRL_MF_IE_SHIFT)

/*
 * HL_IE (RW)
 *
 * HLT Interrupt Enable
 */
#define SDM_CH_SCCTRL_HL_IE_MASK (0x200000UL)
#define SDM_CH_SCCTRL_HL_IE_SHIFT (21U)
#define SDM_CH_SCCTRL_HL_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_HL_IE_SHIFT) & SDM_CH_SCCTRL_HL_IE_MASK)
#define SDM_CH_SCCTRL_HL_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_HL_IE_MASK) >> SDM_CH_SCCTRL_HL_IE_SHIFT)

/*
 * LL_IE (RW)
 *
 * LLT interrupt Enable
 */
#define SDM_CH_SCCTRL_LL_IE_MASK (0x100000UL)
#define SDM_CH_SCCTRL_LL_IE_SHIFT (20U)
#define SDM_CH_SCCTRL_LL_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_LL_IE_SHIFT) & SDM_CH_SCCTRL_LL_IE_MASK)
#define SDM_CH_SCCTRL_LL_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_LL_IE_MASK) >> SDM_CH_SCCTRL_LL_IE_SHIFT)

/*
 * SGD_ORDR (RW)
 *
 * CIC order
 * 0: SYNC1
 * 1: SYNC2
 * 2: SYNC3
 * 3: FAST_SYNC
 */
#define SDM_CH_SCCTRL_SGD_ORDR_MASK (0xC0000UL)
#define SDM_CH_SCCTRL_SGD_ORDR_SHIFT (18U)
#define SDM_CH_SCCTRL_SGD_ORDR_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_SGD_ORDR_SHIFT) & SDM_CH_SCCTRL_SGD_ORDR_MASK)
#define SDM_CH_SCCTRL_SGD_ORDR_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_SGD_ORDR_MASK) >> SDM_CH_SCCTRL_SGD_ORDR_SHIFT)

/*
 * CIC_DEC_RATIO (RW)
 *
 * CIC decimation ratio. 0 means div-by-32
 */
#define SDM_CH_SCCTRL_CIC_DEC_RATIO_MASK (0x1F0U)
#define SDM_CH_SCCTRL_CIC_DEC_RATIO_SHIFT (4U)
#define SDM_CH_SCCTRL_CIC_DEC_RATIO_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_CIC_DEC_RATIO_SHIFT) & SDM_CH_SCCTRL_CIC_DEC_RATIO_MASK)
#define SDM_CH_SCCTRL_CIC_DEC_RATIO_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_CIC_DEC_RATIO_MASK) >> SDM_CH_SCCTRL_CIC_DEC_RATIO_SHIFT)

/*
 * IGN_INI_SAMPLES (RW)
 *
 * NotZero: Ignore the first samples that are not accurate
 * Zero: Use all samples
 */
#define SDM_CH_SCCTRL_IGN_INI_SAMPLES_MASK (0xEU)
#define SDM_CH_SCCTRL_IGN_INI_SAMPLES_SHIFT (1U)
#define SDM_CH_SCCTRL_IGN_INI_SAMPLES_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_IGN_INI_SAMPLES_SHIFT) & SDM_CH_SCCTRL_IGN_INI_SAMPLES_MASK)
#define SDM_CH_SCCTRL_IGN_INI_SAMPLES_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_IGN_INI_SAMPLES_MASK) >> SDM_CH_SCCTRL_IGN_INI_SAMPLES_SHIFT)

/*
 * EN (RW)
 *
 * Amplitude Path Enable
 */
#define SDM_CH_SCCTRL_EN_MASK (0x1U)
#define SDM_CH_SCCTRL_EN_SHIFT (0U)
#define SDM_CH_SCCTRL_EN_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_EN_SHIFT) & SDM_CH_SCCTRL_EN_MASK)
#define SDM_CH_SCCTRL_EN_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_EN_MASK) >> SDM_CH_SCCTRL_EN_SHIFT)

/* Bitfield definition for register of struct array CH: SCST */
/*
 * HZ (W1C)
 *
 * Amplitude rising above HZ event found.
 */
#define SDM_CH_SCST_HZ_MASK (0x8U)
#define SDM_CH_SCST_HZ_SHIFT (3U)
#define SDM_CH_SCST_HZ_SET(x) (((uint32_t)(x) << SDM_CH_SCST_HZ_SHIFT) & SDM_CH_SCST_HZ_MASK)
#define SDM_CH_SCST_HZ_GET(x) (((uint32_t)(x) & SDM_CH_SCST_HZ_MASK) >> SDM_CH_SCST_HZ_SHIFT)

/*
 * MF (W1C)
 *
 * power modulator Failure found. MCLK not found. Error flag.
 */
#define SDM_CH_SCST_MF_MASK (0x4U)
#define SDM_CH_SCST_MF_SHIFT (2U)
#define SDM_CH_SCST_MF_SET(x) (((uint32_t)(x) << SDM_CH_SCST_MF_SHIFT) & SDM_CH_SCST_MF_MASK)
#define SDM_CH_SCST_MF_GET(x) (((uint32_t)(x) & SDM_CH_SCST_MF_MASK) >> SDM_CH_SCST_MF_SHIFT)

/*
 * CMPH (W1C)
 *
 * HLT out of range. Error flag.
 */
#define SDM_CH_SCST_CMPH_MASK (0x2U)
#define SDM_CH_SCST_CMPH_SHIFT (1U)
#define SDM_CH_SCST_CMPH_SET(x) (((uint32_t)(x) << SDM_CH_SCST_CMPH_SHIFT) & SDM_CH_SCST_CMPH_MASK)
#define SDM_CH_SCST_CMPH_GET(x) (((uint32_t)(x) & SDM_CH_SCST_CMPH_MASK) >> SDM_CH_SCST_CMPH_SHIFT)

/*
 * CMPL (W1C)
 *
 * LLT out of range. Error flag.
 */
#define SDM_CH_SCST_CMPL_MASK (0x1U)
#define SDM_CH_SCST_CMPL_SHIFT (0U)
#define SDM_CH_SCST_CMPL_SET(x) (((uint32_t)(x) << SDM_CH_SCST_CMPL_SHIFT) & SDM_CH_SCST_CMPL_MASK)
#define SDM_CH_SCST_CMPL_GET(x) (((uint32_t)(x) & SDM_CH_SCST_CMPL_MASK) >> SDM_CH_SCST_CMPL_SHIFT)



/* CH register group index macro definition */
#define SDM_CH_0 (0UL)
#define SDM_CH_1 (1UL)
#define SDM_CH_2 (2UL)
#define SDM_CH_3 (3UL)


#endif /* HPM_SDM_H */
